Store Sales - Time Series Forecasting
https://www.kaggle.com/competitions/store-sales-time-series-forecasting

# 【コンペについて】
エクアドルの大手食品小売店Corporacion Favirutaのデータから、時系列予測を使って店舗の売上を予測する。

# 【データについて】
### train.csv
* store_nbr・・・商品が販売されている店舗を特定する。
* family・・・売られている商品のタイプを特定する。
* sales・・・特定の店舗における商品群の、ある日付での総売上高。
* onpromotion・・・商品群の中で、ある日付にtんぽでプロモーションされていた商品の総数。

### test.csv
* train.csvと同じ特徴量を持っている。このファイルでtargetの予測をする。
* テストデータのdatesは、トレーニングデータの中の最後の日付の１５日間後。

### sample_submission
* 提出ファイルのサンプル

### oil.csv
* 原油価格の日別推移。トレーニングデータとテストデータの両方の時間枠の値を含む。(エクアドルは石油に依存した国で、経済的健全性は石油価格のショックに非常に脆弱）

### holiday_events.csv
* 祝日とイベント、メタデータ付き
* 追加の祝日は、通常のカレンダーの祝日に追加された日で、たとえば、一般的にクリスマスなど。

# 【ファイルやライブラリを読み込む】

### ライブラリ

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### ファイル

In [7]:
train_df = pd.read_csv('store-sales-time-series-forecasting/train.csv')
test_df = pd.read_csv('store-sales-time-series-forecasting/test.csv')
sample_submission = pd.read_csv('store-sales-time-series-forecasting/sample_submission.csv')

In [8]:
train_df.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [9]:
test_df.head()

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [10]:
sample_submission.head()

        id  sales
0  3000888    0.0
1  3000889    0.0
2  3000890    0.0
3  3000891    0.0
4  3000892    0.0